<template>
  <div class="app">
    <!--<FontAwesomeIcon icon="star" />-->


  </div>
</template>


<script setup>
import { ref } from 'vue'

const books = ref(
  {
    title: 'Мастер и Маргарита',
    description: '«Мастер и Маргарита» — роман Михаила Афанасьевича Булгакова, работа над которым началась, по одним данным, в 1928 году, по другим — в 1929-м, и продолжалась вплоть до смерти писателя в марте 1940 года.',
    genre: 'Роман',
    img: '',
    isAdult: false,
    stars: 5
  },
  {
    title: 'Бэтман Аполло',
    description: 'Главный герой — Рама, сравнительно недавно ставший вампиром. Ему предстоит разобраться в вампирском мироздании и подняться по иерархической лестнице, став Кавалером Ночи и ныряльщиком.',
    genre: 'Роман',
    img: '',
    isAdult: false,
    stars: 4
  },
  {
    title: 'Стратегическое управление на основе маркетингового анализа. Инструменты, проблемы, ситуации',
    description: 'Книга в которой автор описывает классические и собственные инструменты стратегического управления и маркетингового анализа.',
    genre: 'бизнес-книга',
    img: '',
    isAdult: false,
    stars: 4
  }
)
</script>
